print("hello world")   
  # hello world را چاپ میکند
##########################################################
if 5>2:
  print("Five is greater than two")
  if 5>2:
    print("Five is greater than two")  
    #اگر5بزرگتر از 2باشد دو بار این جمله را چاپ میکند
 ##########################################################
  x=5
  y="john"
  print(x) 
   # 5 را چاپ میکند
  print(y)
    #john  را چاپ میکند
  ############################################################
  x=str(3)
  y=int(3)
  z=float(3)
  print(x) 
   # 3 استرینگ را چاپ میکند ( رشته )
  print(y)  
  #عدد 3 صحیح را چاپ میکند
  print(z)   
  # عدد اعشاری را چاپ میکند
 ##############################################################
  x=5
  y="john"
  print(type(x)) 
   #این کد دیتا تایپ متغیر را مشخص میکند
  print(type(y)) 
   # این کد دیتا تایپ متغیر را مشخص میکند
 ###############################################################
  x = "john"
  x ='john'
  # این دو کد مثل هم هستن برابر هستن و هیچ فرقی ندارند
  #############################################################
  a = 4
  A = "sally"
  print(a)   
  # این کد 4 را چاپ میکند
  print(A) 
   # این کد sally را چاپ میکند
  # زبان پایتون بر حروف کوچک و بزرگ حساس است
  #############################################################
  x , y , z = "orange" , "banana" , "cherry"
  print(x)   
    # این کد اورنج را چاپ میکند
  print (y)   
   # این کد  bananan را چاپ میکند
  print(z)    
   # این کد چری را چاپ میکند
  ############################################################
  x = y = z ="orange"
  print(x)     
  print (y)  
  print(z) 
  # این سه متغییر orange را چاپ میکند
  #هر سه متغیر orangeرا نشان می دهند 
  ############################################################
  fruits = ["apple","banana","cherry"] 
  x , y , z = fruits
  print(x)  
     #اپل را چاپ میکند
  print(y)     
    #این کد banana را چاپ میکند
  print(z)     
   # این کد cherry را چاپ می کند
  ############################################################
  x = "python"
  y = "is"
  z = "awesome"
  print(x+y+z)   
    # چون string است سه دیتاتایپ را به هم میچسباند
  #python is awesome
  #############################################################
  x = 5
  y = 10
  print(x=y)   
    # چون x و y  int هستند جمع میشوند
  # 15
  #############################################################
  x = "awesome"
  def myfunc():
    print("python is" +x) 
    # چون جفت اینا string هستند به هم میچسبند
    myfunc()
    ############################################################